app/views/event/_singleFind.html.erb

		<li><%=t.city + " " + t.name%></li>
 		<%e.schedules.each do |s|
---
SELECT `schedules`.* FROM `schedules` WHERE `schedules`.`event_id` IN (1, 2)

 		end%>
 		<%e.moneyLines.each do |m|
---
SELECT `money_lines`.* FROM `money_lines` WHERE `money_lines`.`event_id` IN (1, 2)

		end
		e.spreads.each do |sp|
---
SELECT `spreads`.* FROM `spreads` WHERE `spreads`.`event_id` IN (1)

 <%end
 	e.overUnders.each do |ou|
---
SELECT `over_unders`.* FROM `over_unders` WHERE `over_unders`.`event_id` IN (1)