app/views/event/find.html.erb

SELECT `teams`.* FROM `teams` INNER JOIN `schedules` ON `teams`.`id` = `schedules`.`team_id` WHERE `schedules`.`event_id` = 1
---
bet_by: <%=e.bet_by%><br/>
	<%e.teams.each do |t|%>

SELECT `money_lines`.* FROM `money_lines` WHERE `money_lines`.`event_id` IN (1, 2)
---
	<%end%>
	<%e.moneyLines.each do |m|%>