app/controllers/event_controller.rb

	def find
		#Rails.logger.info("PARAMS: #{params.inspect}")
		@events = Event.filtered(params)
		@allSportsCat = SportsCategory.all
		@allSports = Sport.includes(:teams).all
---
SELECT `sports_categories`.* FROM `sports_categories`
SELECT DISTINCT `teams`.* FROM `teams` INNER JOIN `schedules` ON `schedules`.`team_id` = `teams`.`id` WHERE `schedules`.`event_id` IN (1)
SELECT `sports`.* FROM `sports`

	def selects
		@result = SportsCategory.includes(:sports => :teams).all.map {|s| s.test}
---
SELECT `sports_categories`.* FROM `sports_categories`
SELECT `sports`.* FROM `sports` WHERE `sports`.`sportsCategory_id` IN (1, 2)
SELECT `teams`.* FROM `teams` WHERE `teams`.`sport_id` IN (1, 2)