app/controllers/user_controller.rb

	def index
		@Users = User.all
---
SELECT `users`.* FROM `users`

	def show
		@User = User.find_by_user(params[:id])
		@Memberships = @User.memberships.includes(:group)
---
SELECT `users`.* FROM `users` WHERE `users`.`user` = 'dustin' LIMIT 1
SELECT `users`.* FROM `users`

	def create
		@user = User.new(params[:user])

		respond_to do |format|
			if @user.save
---
INSERT INTO `users` (`created_at`, `currency`, `email`, `fb`, `name`, `password`, `updated_at`, `user`) VALUES ('2012-04-15 03:29:40', NULL, 'jake@test.com', NULL, 'jake', 'test', '2012-04-15 03:29:40', 'jake')

	def find_groups_by_event
		@user = User.find(params[:user])
---
SELECT 1 FROM `users` WHERE `users`.`user` = BINARY '' LIMIT 1